Revit 2027 API
BuiltInFailures.CurtainWallFailures.InvalidSkipSegments Property
 A curtain grid line had invalid removed segment data. When correcting data, Revit may have split curtain panels that should be combined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidSkipSegments { get; }
Public Shared ReadOnly Property InvalidSkipSegments As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidSkipSegments {
	FailureDefinitionId^ get ();
}
static member InvalidSkipSegments : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace